{"data":{"site":{"siteMetadata":{"title":"Tiago Marinho","author":"Tiago Marinho"}},"markdownRemark":{"id":"da97423a-1513-578c-96b6-30a64fb8178a","html":"<p>In this post I will talk about some important projects that I have participated and about me.</p>\n<!-- end -->\n<h2>Pre Diabetics Recommendation System</h2>\n<p>In this project I was developing a smart application that analyzed users data and according to a decision tree (which was a database given by medical people), were given a diagnostic aid, showing whether the user tended to have diabetes or not.</p>\n<ul>\n<li>Morbi sit amet turpis a purus</li>\n<li>\n<p>Etiam tempor ultricies mi</p>\n<ul>\n<li>Maecenas auctor enim a volutpat mattis</li>\n</ul>\n</li>\n<li>Sed urna justo, scelerisque consectetur pharetra vitae</li>\n</ul>\n<p>Nam nec augue vel nisl placerat faucibus. Donec congue <strong>nulla quis nunc</strong> sagittis placerat. Pellentesque non tincidunt velit, cursus porttitor tellus. Suspendisse pulvinar tortor at <em>augue aliquam sagittis</em>. Duis non pulvinar augue. Ut tristique dignissim ligula, eget tempus diam molestie non. Nulla ultrices eleifend rutrum. Mauris convallis sollicitudin dui, pulvinar suscipit velit. Maecenas viverra finibus metus vitae blandit.</p>\n<h3>Pellentesque consectetur facilisis venenatis</h3>\n<p>Nam ullamcorper, orci nec tempor hendrerit, lorem nunc laoreet diam, vel gravida sem mi quis augue. Nunc odio velit, facilisis quis dictum non, facilisis quis felis. Vivamus <a href=\"https://google.com\">elementum dapibus nibh</a>, eget aliquet nunc luctus maximus. Sed finibus risus eget ultrices maximus. Aliquam commodo consectetur diam eget tristique. Nunc quis erat quis felis fringilla tempus. Cras tempor nibh dolor, ac lacinia lacus ultrices eu.</p>\n<blockquote>\n<p>Quisque tempor nulla turpis, ut placerat arcu lobortis nec. Aenean sed vehicula nisi. Nullam vitae placerat enim. Etiam hendrerit enim vel tempor fermentum. Morbi rutrum euismod ipsum a luctus.</p>\n</blockquote>\n<p>Morbi et libero id metus tempor imperdiet eget non mi. Mauris pulvinar quis enim at placerat. Vestibulum vitae dapibus lectus, ut elementum est.</p>\n<h3>Pellentesque facilisis venenatis mi, sit amet molestie nisl ornare et</h3>\n<p>Morbi posuere facilisis eros vel euismod. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Etiam malesuada dapibus dolor non cursus. Sed in turpis justo. Cras sed hendrerit nulla. Sed ornare, leo et suscipit tincidunt, justo diam sollicitudin risus, vitae vulputate nulla augue et lacus.</p>\n<ol>\n<li>Morbi posuere facilisis</li>\n<li>Pellentesque habitant morbi tristique</li>\n<li>Etiam malesuada dapibus</li>\n</ol>\n<p>Ut vel ligula ante. Proin quis metus magna. Nulla nec dui vulputate, semper orci in, sagittis dolor. Mauris dictum neque non fermentum consectetur. Integer vel pellentesque ex, ut tincidunt quam.</p>\n<h4>Sed ac orci a dolor venenatis vulputate</h4>\n<p>Sed sollicitudin, turpis ac malesuada dapibus, magna dui semper orci, in congue justo felis quis ante. Phasellus consequat et dolor fringilla accumsan. Pellentesque ullamcorper porttitor dolor et imperdiet.</p>\n<p><img src=\"./space.jpg\" alt=\"Space\"></p>\n<p>Pellentesque consectetur facilisis venenatis. Nam ullamcorper, orci nec tempor hendrerit, lorem nunc laoreet diam, vel gravida sem mi quis augue. Nunc odio velit, facilisis quis dictum non, facilisis quis felis. Vivamus elementum dapibus nibh, eget aliquet nunc luctus maximus. Sed finibus risus eget ultrices maximus. Aliquam commodo consectetur diam eget tristique. Nunc quis erat quis felis fringilla tempus. Cras tempor nibh dolor, ac lacinia lacus ultrices eu.</p>\n<h5>Nulla nec dui vulputate, semper orci in, sagittis dolor</h5>\n<p>Mauris dictum neque non fermentum consectetur. Integer vel pellentesque ex, ut tincidunt quam. Sed ac orci a dolor venenatis vulputate. Sed sollicitudin, turpis ac malesuada dapibus, magna dui semper orci, in congue justo felis quis ante. Phasellus consequat et dolor fringilla accumsan. Pellentesque ullamcorper porttitor dolor et imperdiet.</p>\n<div class=\"gatsby-highlight\" data-language=\"javascript\"><pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token function\">$</span><span class=\"token punctuation\">(</span>document<span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span><span class=\"token function\">ready</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">function</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n    console<span class=\"token punctuation\">.</span><span class=\"token function\">log</span><span class=\"token punctuation\">(</span><span class=\"token string\">'More jQuery, wow!'</span><span class=\"token punctuation\">)</span>\n<span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span></code></pre></div>\n<h6>ras aliquet ipsum ut enim pellentesque, id varius quam placerat</h6>\n<p>Maecenas non scelerisque leo. Sed id purus fringilla, consequat magna non, faucibus neque. Cras ornare nisi a lectus ultricies convallis. Integer tristique dictum eros, et elementum ante consectetur eget. Phasellus sollicitudin est vestibulum suscipit pellentesque. Duis in eros cursus magna laoreet aliquam vel a lectus. Nulla ut nisi vitae ipsum sollicitudin vestibulum. Aenean sit amet mattis odio. Vestibulum ultrices sed ipsum nec pretium. Integer non turpis nunc. Praesent tincidunt tincidunt alique</p>\n<p>Integer mollis dolor non libero placerat, ut efficitur nisi ultricies. Etiam ac lacinia urna, eget ornare nunc. Suspendisse eget eros id turpis gravida semper. Duis ornare lorem et est pellentesque, quis rhoncus leo vestibulum. Nullam eu nulla ut elit rutrum iaculis. Cras a laoreet elit, in aliquet erat. Sed interdum varius posuere. Pellentesque eget luctus erat. Nam quis sem in ligula efficitur bibendum.</p>","frontmatter":{"title":"Some projects and about me!","date":"October 17, 2019","featuredImage":null}}},"pageContext":{"slug":"/about-my-projects/","previous":{"fields":{"slug":"/hello-world/"},"excerpt":"\nTeste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste Teste teste\n\n","frontmatter":{"title":"Hello World","date":"June 30, 2018","featuredImage":null}},"next":{"fields":{"slug":"/welcome-to-the-blog/"},"excerpt":"\nIn this post I will talk about some important projects that I have participated.\n\n","frontmatter":{"title":"About my projects!","date":"October 17, 2019","featuredImage":{"childImageSharp":{"sizes":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAJABQDASIAAhEBAxEB/8QAGQAAAQUAAAAAAAAAAAAAAAAAAAECAwQF/8QAFgEBAQEAAAAAAAAAAAAAAAAAAwAB/9oADAMBAAIQAxAAAAHKtownhAs//8QAFxABAQEBAAAAAAAAAAAAAAAAAAIyA//aAAgBAQABBQKIVhxTp//EABURAQEAAAAAAAAAAAAAAAAAAAEQ/9oACAEDAQE/ASf/xAAWEQADAAAAAAAAAAAAAAAAAAABEEH/2gAIAQIBAT8BNX//xAAZEAEAAgMAAAAAAAAAAAAAAAABABAxQXH/2gAIAQEABj8CgbM08jX/xAAbEAACAgMBAAAAAAAAAAAAAAAAAREhMUFRof/aAAgBAQABPyGR9LoObhCdmZeU0f/aAAwDAQACAAMAAAAQiy//xAAYEQACAwAAAAAAAAAAAAAAAAAAAREhYf/aAAgBAwEBPxBIS0o//8QAFhEAAwAAAAAAAAAAAAAAAAAAARCR/9oACAECAQE/EChf/8QAHRAAAgEEAwAAAAAAAAAAAAAAAAERMVGBoSGxwf/aAAgBAQABPxBHE5LRFKTYFRUSxYcW5G9Nv4KjPbP/2Q==","aspectRatio":2.2,"src":"/static/featured-09591b6c0ecf431ce8117c089d40cc3a-6b3a1.jpg","srcSet":"/static/featured-09591b6c0ecf431ce8117c089d40cc3a-182ff.jpg 213w,\n/static/featured-09591b6c0ecf431ce8117c089d40cc3a-7f5c7.jpg 425w,\n/static/featured-09591b6c0ecf431ce8117c089d40cc3a-6b3a1.jpg 850w,\n/static/featured-09591b6c0ecf431ce8117c089d40cc3a-838e8.jpg 1100w","sizes":"(max-width: 850px) 100vw, 850px"}}}}}}}